Autodesk.Revit.UI.RevitFileInfo.SetLocalPath(System.String)
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was NULL
Since:
2019

Autodesk.Revit.UI.RevitFileInfo.Path
The path of the recent file.
If a cloud file, the path looks like "cld://{GUID}Shanghai%20Design%20Center/{GUID}4walls.rvt"
If a local file, the path looks like "c:\4wall.rvt".
Since:
2019

Autodesk.Revit.UI.RevitFileInfo.Name
The name of the recent file.
If a cloud file, it looks like "BIM 360://Shanghai Design Center/4walls.rvt"
If a local file, path, localPath and name are all the same.
Since:
2019